<a href="https://datamics.com/de/courses/"><img src=./../DATA/bg_datamics_top.png></a>

<em text-align:center>© Datamics</em>
# Pandas Crashkurs

Wir werden Numpy mehr verwenden als Pandas. Hier geben wir dir einen schnellen Überblick über Panda, falls du es noch nicht gesehen hast.

In [13]:
import pandas as pd

In [14]:
df = pd.read_csv('salaries.csv')

In [15]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [16]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [17]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [18]:
df[['Name','Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [19]:
df['Age']

0    34
1    45
2    27
Name: Age, dtype: int64

In [20]:
df['Age'].mean()

35.333333333333336

In [21]:
df['Age'] > 30

0     True
1     True
2    False
Name: Age, dtype: bool

In [22]:
age_filter = df['Age'] > 30

In [23]:
df[age_filter]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [24]:
df[df['Age'] > 30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

# Gut gemacht!